# RUN: tf-mlir-translate -graphdef-to-mlir %s -tf-input-arrays=arg -tf-input-data-types=DT_INT32 -tf-input-shapes=8 -tf-output-arrays=arg -o - | FileCheck %s --dump-input=fail

node {
  name: "arg"
  op: "_Arg"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "index"
    value {
      i: 0
    }
  }
}
versions {
  producer: 27
}

# CHECK: func @main(%[[ARG_0:[a-z0-9]+]]: tensor<8xi32>) -> tensor<8xi32>
# CHECK: attributes {tf.entry_function = {inputs = "arg", outputs = "arg"}} {
# CHECK:   %[[GRAPH:[0-9]+]] = tf_executor.graph
# CHECK:     tf_executor.fetch %[[ARG_0]]
# CHECK:   return %[[GRAPH]]
