node {
  name: "_tf.PartitionedCall"
  op: "PartitionedCall"
  attr {
    key: "Tin"
    value {
      list {
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "foo"
      }
    }
  }
}
library {
  function {
    signature {
      name: "foo"
      output_arg {
        name: "constant"
        type: DT_FLOAT
      }
    }
    node_def {
      name: "X"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 7
          }
        }
      }
    }
    ret {
      key: "constant"
      value: "X:output:0"
    }
    attr {
      key: "_input_shapes"
      value {
      }
    }
  }
}
versions {
  producer: 85
  min_consumer: 12
}
