node: {
  name: "hash_table_node"
  op: "HashTableV2"
  attr: {
    key: "key_dtype"
    value: {
      type: DT_INT32
    }
  }
  attr: {
    key: "shared_name"
    value: {
      s: ""
    }
  }
  attr: {
    key: "value_dtype"
    value: {
      type: DT_FLOAT
    }
  }
}
node {
  name: "variable_node"
  op: "Variable"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "variable_v2_node"
  op: "VariableV2"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Call"
  op: "PartitionedCall"
  attr {
    key: "Tin"
    value {
      list {
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_RESOURCE
      }
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "create_resource"
      }
    }
  }
}
library {
  function {
    signature {
      name: "create_resource"
      output_arg {
        name: "handle"
        type: DT_RESOURCE
      }
    }
    node_def: {
      name: "hash_table_node"
      op: "HashTableV2"
      attr: {
        key: "key_dtype"
        value: {
          type: DT_INT32
        }
      }
      attr: {
        key: "shared_name"
        value: {
          s: ""
        }
      }
      attr: {
        key: "value_dtype"
        value: {
          type: DT_FLOAT
        }
      }
    }
    ret {
      key: "handle"
      value: "hash_table_node:table_handle:0"
    }
  }
}
