node {
  name: "custom_relu_func_call"
  op: "custom_relu"
}
node {
  name: "custom_embedding_matmul_func_call"
  op: "custom_embedding_matmul"
}
library {
  function {
    signature {
      name: "custom_relu"
    }
    attr {
      key: "_implements"
      value {
        func {
          name: "tensorflow.relu"
        }
      }
    }
  }
  function {
    signature {
      name: "custom_embedding_matmul"
    }
    attr {
      key: "_implements"
      value {
        func {
          name: "tensorflow.embedding_matmul"
          attr {
            key: "key1"
            value {
              i: 2
            }
          }
          attr {
            key: "key2"
            value {
              b: false
            }
          }
        }
      }
    }
  }
}
