node {
  name: "unnamed"
  op: "foo"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "_disable_call_shape_inference"
    value {
      b: true
    }
  }
  experimental_debug_info {
  }
}
node {
  name: "unnamed1"
  op: "bar"
  experimental_debug_info {
  }
}
library {
  function {
    signature {
      name: "bar"
    }
  }
  function {
    signature {
      name: "foo"
    }
    node_def {
      name: "unnamed"
      op: "bar"
      experimental_debug_info {
        original_node_names: "unnamed"
      }
    }
  }
}
versions {
  producer: 29
  min_consumer: 12
}
