# RUN: not tfg-translate -graphdef-to-mlir %s 2>&1 | FileCheck %s

# CHECK: Control output 'missing' was not found in 'control_ret'

library {
  function {
    signature {
      name: "test"
      output_arg {
        name: "output"
        type: DT_INT32
      }
      control_output: "missing"
    }
    node_def {
      name: "const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
          }
        }
      }
    }
    ret {
      key: "output"
      value: "const"
    }
    control_ret {
      key: "control_output"
      value: "const"
    }
  }
}
