# proto-file: third_party/tensorflow/core/framework/graph.proto
# proto-message: GraphDef
#
# Proto content generated by
#
# import tensorflow as tf
#
# dataset = tf.data.Dataset.from_tensor_slices(["a", "b", "c"])
# dataset = dataset.enumerate()
#
# g = tf.compat.v1.GraphDef()
# g.ParseFromString(dataset._as_serialized_graph().numpy())
# print(g)

node {
  name: "Const/_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "Const/_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 9223372036854775807
      }
    }
  }
}
node {
  name: "Const/_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "RangeDataset/_3"
  op: "RangeDataset"
  input: "Const/_0"
  input: "Const/_1"
  input: "Const/_2"
  attr {
    key: "metadata"
    value {
      s: "\n\016RangeDataset:9"
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_INT64
      }
    }
  }
  attr {
    key: "replicate_on_split"
    value {
      b: true
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_DATASET
      args {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_INT64
          }
        }
      }
    }
  }
}
node {
  name: "Const/_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\001\001abc"
      }
    }
  }
}
node {
  name: "TensorSliceDataset/_5"
  op: "TensorSliceDataset"
  input: "Const/_4"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "is_files"
    value {
      b: false
    }
  }
  attr {
    key: "metadata"
    value {
      s: "\n\024TensorSliceDataset:7"
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "replicate_on_split"
    value {
      b: false
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_DATASET
      args {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_STRING
          }
        }
      }
    }
  }
}
node {
  name: "ZipDataset/_6"
  op: "ZipDataset"
  input: "RangeDataset/_3"
  input: "TensorSliceDataset/_5"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "metadata"
    value {
      s: "\n\rZipDataset:10"
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_INT64
        type: DT_STRING
      }
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_DATASET
      args {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_INT64
          }
        }
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_STRING
          }
        }
      }
    }
  }
}
node {
  name: "dataset"
  op: "_Retval"
  input: "ZipDataset/_6"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
  attr {
    key: "index"
    value {
      i: 0
    }
  }
}
library {
}
versions {
  producer: 1700
}
