# proto-file: third_party/tensorflow/core/framework/graph.proto
# proto-message: GraphDef
#
# Proto content generated by
#
# import tensorflow as tf
#
# datasets = [tf.data.Dataset.from_tensor_slices(["a", "a", "a", "a", "a"]),
#             tf.data.Dataset.from_tensor_slices(["b", "b", "b", "b", "b"]),
#             tf.data.Dataset.from_tensor_slices(["c", "c", "c", "c", "c"])]
# dataset = tf.data.Dataset.sample_from_datasets(
#     datasets, weights=[1.0] * len(datasets))
#
# g = tf.compat.v1.GraphDef()
# g.ParseFromString(dataset._as_serialized_graph().numpy())
# print(g)

node {
  name: "Const/_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "Const/_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "RandomDataset/_2"
  op: "RandomDataset"
  input: "Const/_0"
  input: "Const/_1"
  attr {
    key: "metadata"
    value {
      s: "\n\017RandomDataset:3"
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_INT64
      }
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_DATASET
      args {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_INT64
          }
        }
      }
    }
  }
}
node {
  name: "Const/_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 2
      }
    }
  }
}
node {
  name: "Const/_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "BatchDatasetV2/_5"
  op: "BatchDatasetV2"
  input: "RandomDataset/_2"
  input: "Const/_3"
  input: "Const/_4"
  attr {
    key: "metadata"
    value {
      s: "\n\020BatchDatasetV2:4"
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_INT64
      }
    }
  }
  attr {
    key: "parallel_copy"
    value {
      b: false
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_DATASET
      args {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_INT64
          }
        }
      }
    }
  }
}
node {
  name: "Const/_6"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "MapDataset/_7"
  op: "MapDataset"
  input: "BatchDatasetV2/_5"
  input: "Const/_6"
  attr {
    key: "Targuments"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "__inference_Dataset_map_select_dataset_constant_logits_24"
      }
    }
  }
  attr {
    key: "metadata"
    value {
      s: "\n\014MapDataset:5"
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_INT64
      }
    }
  }
  attr {
    key: "preserve_cardinality"
    value {
      b: true
    }
  }
  attr {
    key: "use_inter_op_parallelism"
    value {
      b: false
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_DATASET
      args {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_INT64
          }
        }
      }
    }
  }
}
node {
  name: "Const/_8"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 5
          }
        }
        tensor_content: "\001\001\001\001\001aaaaa"
      }
    }
  }
}
node {
  name: "TensorSliceDataset/_9"
  op: "TensorSliceDataset"
  input: "Const/_8"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "is_files"
    value {
      b: false
    }
  }
  attr {
    key: "metadata"
    value {
      s: "\n\024TensorSliceDataset:0"
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "replicate_on_split"
    value {
      b: false
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_DATASET
      args {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_STRING
          }
        }
      }
    }
  }
}
node {
  name: "Const/_10"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 5
          }
        }
        tensor_content: "\001\001\001\001\001bbbbb"
      }
    }
  }
}
node {
  name: "TensorSliceDataset/_11"
  op: "TensorSliceDataset"
  input: "Const/_10"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "is_files"
    value {
      b: false
    }
  }
  attr {
    key: "metadata"
    value {
      s: "\n\024TensorSliceDataset:1"
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "replicate_on_split"
    value {
      b: false
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_DATASET
      args {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_STRING
          }
        }
      }
    }
  }
}
node {
  name: "Const/_12"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 5
          }
        }
        tensor_content: "\001\001\001\001\001ccccc"
      }
    }
  }
}
node {
  name: "TensorSliceDataset/_13"
  op: "TensorSliceDataset"
  input: "Const/_12"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "is_files"
    value {
      b: false
    }
  }
  attr {
    key: "metadata"
    value {
      s: "\n\024TensorSliceDataset:2"
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "replicate_on_split"
    value {
      b: false
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_DATASET
      args {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_STRING
          }
        }
      }
    }
  }
}
node {
  name: "DirectedInterleaveDataset/_14"
  op: "DirectedInterleaveDataset"
  input: "MapDataset/_7"
  input: "TensorSliceDataset/_9"
  input: "TensorSliceDataset/_11"
  input: "TensorSliceDataset/_13"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "stop_on_empty_dataset"
    value {
      b: false
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_DATASET
      args {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_TENSOR
          args {
            type_id: TFT_STRING
          }
        }
      }
    }
  }
}
node {
  name: "dataset"
  op: "_Retval"
  input: "DirectedInterleaveDataset/_14"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
  attr {
    key: "index"
    value {
      i: 0
    }
  }
}
library {
  function {
    signature {
      name: "__inference_Dataset_map_select_dataset_constant_logits_24"
      input_arg {
        name: "args_0"
        type: DT_INT64
      }
      input_arg {
        name: "statelessmultinomial_logits"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity"
        type: DT_INT64
      }
    }
    node_def {
      name: "StatelessMultinomial/num_samples"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "StatelessMultinomial"
      op: "StatelessMultinomial"
      input: "statelessmultinomial_logits"
      input: "StatelessMultinomial/num_samples:output:0"
      input: "args_0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tseed"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "output_dtype"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "Squeeze"
      op: "Squeeze"
      input: "StatelessMultinomial:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "squeeze_dims"
        value {
          list {
            i: 0
            i: 1
          }
        }
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "Squeeze:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    attr {
      key: "_construction_context"
      value {
        s: "kEagerRuntime"
      }
    }
    attr {
      key: "_tf_data_function"
      value {
        b: true
      }
    }
    arg_attr {
      key: 0
      value {
        attr {
          key: "_output_shapes"
          value {
            list {
              shape {
                dim {
                  size: -1
                }
              }
            }
          }
        }
        attr {
          key: "_user_specified_name"
          value {
            s: "args_0"
          }
        }
      }
    }
    arg_attr {
      key: 1
      value {
        attr {
          key: "_output_shapes"
          value {
            list {
              shape {
                dim {
                  size: 1
                }
                dim {
                  size: 3
                }
              }
            }
          }
        }
      }
    }
  }
}
versions {
  producer: 1700
}
