# RUN: tf_tfl_translate -tf-input-arrays=INPUT -tf-input-shapes=1,3,3 -tf-input-data-types=DT_FLOAT -tf-output-arrays=OUTPUT %s -o - --output-mlir | FileCheck %s

node {
  name: "INPUT"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "unstack"
  op: "Unpack"
  input: "INPUT"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "axis"
    value {
      i: 1
    }
  }
  attr {
    key: "num"
    value {
      i: 3
    }
  }
}
node {
  name: "rnn/Shape"
  op: "Shape"
  input: "unstack"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "rnn/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "rnn/strided_slice"
  op: "StridedSlice"
  input: "rnn/Shape"
  input: "rnn/strided_slice/stack"
  input: "rnn/strided_slice/stack_1"
  input: "rnn/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/ExpandDims"
  op: "ExpandDims"
  input: "rnn/strided_slice"
  input: "rnn/TFLiteLSTMCellZeroState/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/concat"
  op: "ConcatV2"
  input: "rnn/TFLiteLSTMCellZeroState/ExpandDims"
  input: "rnn/TFLiteLSTMCellZeroState/Const"
  input: "rnn/TFLiteLSTMCellZeroState/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/zeros"
  op: "Fill"
  input: "rnn/TFLiteLSTMCellZeroState/concat"
  input: "rnn/TFLiteLSTMCellZeroState/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/ExpandDims_2/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/ExpandDims_2"
  op: "ExpandDims"
  input: "rnn/strided_slice"
  input: "rnn/TFLiteLSTMCellZeroState/ExpandDims_2/dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/concat_1"
  op: "ConcatV2"
  input: "rnn/TFLiteLSTMCellZeroState/ExpandDims_2"
  input: "rnn/TFLiteLSTMCellZeroState/Const_2"
  input: "rnn/TFLiteLSTMCellZeroState/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/zeros_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState/zeros_1"
  op: "Fill"
  input: "rnn/TFLiteLSTMCellZeroState/concat_1"
  input: "rnn/TFLiteLSTMCellZeroState/zeros_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/ExpandDims"
  op: "ExpandDims"
  input: "rnn/strided_slice"
  input: "rnn/TFLiteLSTMCellZeroState_1/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/concat"
  op: "ConcatV2"
  input: "rnn/TFLiteLSTMCellZeroState_1/ExpandDims"
  input: "rnn/TFLiteLSTMCellZeroState_1/Const"
  input: "rnn/TFLiteLSTMCellZeroState_1/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/zeros"
  op: "Fill"
  input: "rnn/TFLiteLSTMCellZeroState_1/concat"
  input: "rnn/TFLiteLSTMCellZeroState_1/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/ExpandDims_2/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/ExpandDims_2"
  op: "ExpandDims"
  input: "rnn/strided_slice"
  input: "rnn/TFLiteLSTMCellZeroState_1/ExpandDims_2/dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/concat_1"
  op: "ConcatV2"
  input: "rnn/TFLiteLSTMCellZeroState_1/ExpandDims_2"
  input: "rnn/TFLiteLSTMCellZeroState_1/Const_2"
  input: "rnn/TFLiteLSTMCellZeroState_1/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/zeros_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "rnn/TFLiteLSTMCellZeroState_1/zeros_1"
  op: "Fill"
  input: "rnn/TFLiteLSTMCellZeroState_1/concat_1"
  input: "rnn/TFLiteLSTMCellZeroState_1/zeros_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn/rnn1/input_to_input_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "p\217k>@\254:\276\270W\264\276\014\033N\277p\226a\276\220d+\277\330\277\216>\240VN\276\010\253 \277"
      }
    }
  }
}
node {
  name: "rnn/rnn1/input_to_input_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/input_to_input_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/input_to_input_w"
      }
    }
  }
}
node {
  name: "rnn/rnn1/input_to_input_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/input_to_input_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-1-None-input_to_input_w"
  op: "Identity"
  input: "rnn/rnn1/input_to_input_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 1
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/input_to_forget_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "4X\003?\304g1\277\374H\014?@\341\205=\314\264\023?\324{w?\000.V<PG}>\370Y\242>"
      }
    }
  }
}
node {
  name: "rnn/rnn1/input_to_forget_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/input_to_forget_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/input_to_forget_w"
      }
    }
  }
}
node {
  name: "rnn/rnn1/input_to_forget_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/input_to_forget_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-2-None-input_to_forget_w"
  op: "Identity"
  input: "rnn/rnn1/input_to_forget_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 2
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/input_to_cell_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "p\205\r\276@\321\336\2750_\n\276H\256r?\340\017_\277\220\326J\277\2001\013=T\021\n\277\250\000d?"
      }
    }
  }
}
node {
  name: "rnn/rnn1/input_to_cell_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/input_to_cell_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/input_to_cell_w"
      }
    }
  }
}
node {
  name: "rnn/rnn1/input_to_cell_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/input_to_cell_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-3-None-input_to_cell_w"
  op: "Identity"
  input: "rnn/rnn1/input_to_cell_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 3
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/input_to_output_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "`\222T\276l\273A\277 oZ\277\310\335\211\276\300\310?=H\303\264\276\000\367\217\275@\203\224=DXQ\277"
      }
    }
  }
}
node {
  name: "rnn/rnn1/input_to_output_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/input_to_output_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/input_to_output_w"
      }
    }
  }
}
node {
  name: "rnn/rnn1/input_to_output_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/input_to_output_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-4-None-input_to_output_w"
  op: "Identity"
  input: "rnn/rnn1/input_to_output_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 4
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_input_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "\310\326\374\27609\310\276\250\036\263\276\200\231\256\274L\362\016?\230\337\003\277\350\023\333>\324;\036?p\026@\276"
      }
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_input_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/cell_to_input_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/cell_to_input_w"
      }
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_input_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/cell_to_input_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-5-None-cell_to_input_w"
  op: "Identity"
  input: "rnn/rnn1/cell_to_input_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 5
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_forget_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "\210\334b?\024,\033\277\230\r\347\276\030\257\246>\364\0071?\020\036-\277\000\023a>LD ?\024\374\030\277"
      }
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_forget_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/cell_to_forget_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/cell_to_forget_w"
      }
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_forget_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/cell_to_forget_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-6-None-cell_to_forget_w"
  op: "Identity"
  input: "rnn/rnn1/cell_to_forget_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 6
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_cell_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "\010\341\314\276P6=?p\253N>\364\266-?H;\244>\214*s?\\\307N\277HP\010\277 \226\027>"
      }
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_cell_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/cell_to_cell_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/cell_to_cell_w"
      }
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_cell_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/cell_to_cell_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-7-None-cell_to_cell_w"
  op: "Identity"
  input: "rnn/rnn1/cell_to_cell_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 7
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_output_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "\350\177\343>\300\212\010\276x\357V?\340\r\344>t[\022\277X\330\021?\330\025\356> s}\277L\352!\277"
      }
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_output_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/cell_to_output_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/cell_to_output_w"
      }
    }
  }
}
node {
  name: "rnn/rnn1/cell_to_output_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/cell_to_output_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-8-None-cell_to_output_w"
  op: "Identity"
  input: "rnn/rnn1/cell_to_output_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 8
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/input_bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "rnn/rnn1/input_bias/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/input_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/input_bias"
      }
    }
  }
}
node {
  name: "rnn/rnn1/input_bias/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/input_bias/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-12-None-input_bias"
  op: "Identity"
  input: "rnn/rnn1/input_bias/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 12
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/forget_bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\200?\000\000\200?\000\000\200?"
      }
    }
  }
}
node {
  name: "rnn/rnn1/forget_bias/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/forget_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/forget_bias"
      }
    }
  }
}
node {
  name: "rnn/rnn1/forget_bias/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/forget_bias/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-13-None-forget_bias"
  op: "Identity"
  input: "rnn/rnn1/forget_bias/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 13
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/cell_bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "rnn/rnn1/cell_bias/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/cell_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/cell_bias"
      }
    }
  }
}
node {
  name: "rnn/rnn1/cell_bias/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/cell_bias/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-14-None-cell_bias"
  op: "Identity"
  input: "rnn/rnn1/cell_bias/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 14
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/output_bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "rnn/rnn1/output_bias/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/output_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/output_bias"
      }
    }
  }
}
node {
  name: "rnn/rnn1/output_bias/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/output_bias/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-15-None-output_bias"
  op: "Identity"
  input: "rnn/rnn1/output_bias/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 15
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/w_f_diag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\020o/> \030\035\276\364|\027?"
      }
    }
  }
}
node {
  name: "rnn/rnn1/w_f_diag/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/w_f_diag"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/w_f_diag"
      }
    }
  }
}
node {
  name: "rnn/rnn1/w_f_diag/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/w_f_diag/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-10-None-w_f_diag"
  op: "Identity"
  input: "rnn/rnn1/w_f_diag/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 10
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/w_i_diag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\324\331+\277h\331\322>\250z\017?"
      }
    }
  }
}
node {
  name: "rnn/rnn1/w_i_diag/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/w_i_diag"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/w_i_diag"
      }
    }
  }
}
node {
  name: "rnn/rnn1/w_i_diag/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/w_i_diag/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-9-None-w_i_diag"
  op: "Identity"
  input: "rnn/rnn1/w_i_diag/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 9
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn1/w_o_diag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\230\316\316>\210\316a\277\210\373d\277"
      }
    }
  }
}
node {
  name: "rnn/rnn1/w_o_diag/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn1/w_o_diag"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn1/w_o_diag"
      }
    }
  }
}
node {
  name: "rnn/rnn1/w_o_diag/Read/Identity"
  op: "Identity"
  input: "rnn/rnn1/w_o_diag/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae2de2411e9a4834201c0a80701-11-None-w_o_diag"
  op: "Identity"
  input: "rnn/rnn1/w_o_diag/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 11
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae2de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn2/input_to_input_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "\220\305\000\2760;\245>HV\372>P\356\270>\324u{?\010\265\345\276\370bw?\300[D\2770\212\344>"
      }
    }
  }
}
node {
  name: "rnn/rnn2/input_to_input_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn2/input_to_input_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn2/input_to_input_w"
      }
    }
  }
}
node {
  name: "rnn/rnn2/input_to_input_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn2/input_to_input_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae3de2411e9a4834201c0a80701-1-None-input_to_input_w"
  op: "Identity"
  input: "rnn/rnn2/input_to_input_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 1
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae3de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn2/input_to_forget_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "\354\037d?\000\254\216\276\374\210w?\020;J\277\200bm=P\270^>\234\2702\277$\300{\277\370\231U\277"
      }
    }
  }
}
node {
  name: "rnn/rnn2/input_to_forget_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn2/input_to_forget_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn2/input_to_forget_w"
      }
    }
  }
}
node {
  name: "rnn/rnn2/input_to_forget_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn2/input_to_forget_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae3de2411e9a4834201c0a80701-2-None-input_to_forget_w"
  op: "Identity"
  input: "rnn/rnn2/input_to_forget_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 2
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae3de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn2/input_to_cell_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: ",AH?\200\3616\275,7Y?\024@\024\277p\305\320\276\350\200\342>\000\236\271;\3500\031?T>!?"
      }
    }
  }
}
node {
  name: "rnn/rnn2/input_to_cell_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn2/input_to_cell_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn2/input_to_cell_w"
      }
    }
  }
}
node {
  name: "rnn/rnn2/input_to_cell_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn2/input_to_cell_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae3de2411e9a4834201c0a80701-3-None-input_to_cell_w"
  op: "Identity"
  input: "rnn/rnn2/input_to_cell_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 3
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae3de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn2/input_to_output_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "HO[\2770\355L\277@\2007?\324Q\t?$\251\n?@\221\266\276\370mK\277\240\356\014>\300\2440?"
      }
    }
  }
}
node {
  name: "rnn/rnn2/input_to_output_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn2/input_to_output_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn2/input_to_output_w"
      }
    }
  }
}
node {
  name: "rnn/rnn2/input_to_output_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn2/input_to_output_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae3de2411e9a4834201c0a80701-4-None-input_to_output_w"
  op: "Identity"
  input: "rnn/rnn2/input_to_output_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 4
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae3de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_input_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "\274;\002\277\250\302\026\277`\234\361>\220\r\002\277\000\255\200\274\334\332M\277t\225z\277\000(\322:\024\201z\277"
      }
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_input_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn2/cell_to_input_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn2/cell_to_input_w"
      }
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_input_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn2/cell_to_input_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae3de2411e9a4834201c0a80701-5-None-cell_to_input_w"
  op: "Identity"
  input: "rnn/rnn2/cell_to_input_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 5
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae3de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_forget_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "03:>\014\273\035?\020\333+\276\334\371;?HVu?0\310`\27782\275>\304\020x\277,\212a\277"
      }
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_forget_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn2/cell_to_forget_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn2/cell_to_forget_w"
      }
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_forget_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn2/cell_to_forget_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae3de2411e9a4834201c0a80701-6-None-cell_to_forget_w"
  op: "Identity"
  input: "rnn/rnn2/cell_to_forget_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 6
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae3de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_cell_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "\244\251o\277\230xo\277\340\222\223>\2409y\276|\327 \277pA\364\276\200\325\003\277\300Lg\277\274=,?"
      }
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_cell_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn2/cell_to_cell_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn2/cell_to_cell_w"
      }
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_cell_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn2/cell_to_cell_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae3de2411e9a4834201c0a80701-7-None-cell_to_cell_w"
  op: "Identity"
  input: "rnn/rnn2/cell_to_cell_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 7
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae3de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_output_w"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
        }
        tensor_content: "\274\345\035\277`\202d?\364\333+?8\246W\2778X\267\276\024ER?4TJ?\254T6? g\215="
      }
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_output_w/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn2/cell_to_output_w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn2/cell_to_output_w"
      }
    }
  }
}
node {
  name: "rnn/rnn2/cell_to_output_w/Read/Identity"
  op: "Identity"
  input: "rnn/rnn2/cell_to_output_w/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae3de2411e9a4834201c0a80701-8-None-cell_to_output_w"
  op: "Identity"
  input: "rnn/rnn2/cell_to_output_w/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 8
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae3de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn2/input_bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "rnn/rnn2/input_bias/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn2/input_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn2/input_bias"
      }
    }
  }
}
node {
  name: "rnn/rnn2/input_bias/Read/Identity"
  op: "Identity"
  input: "rnn/rnn2/input_bias/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae3de2411e9a4834201c0a80701-12-None-input_bias"
  op: "Identity"
  input: "rnn/rnn2/input_bias/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 12
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
    key: "_tflite_function_uuid"
    value {
      s: "47eb6ae3de2411e9a4834201c0a80701"
    }
  }
  attr {
    key: "_tflite_ophint_level"
    value {
      i: 1
    }
  }
}
node {
  name: "rnn/rnn2/forget_bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\200?\000\000\200?\000\000\200?"
      }
    }
  }
}
node {
  name: "rnn/rnn2/forget_bias/Read/ReadVariableOp"
  op: "Identity"
  input: "rnn/rnn2/forget_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/rnn2/forget_bias"
      }
    }
  }
}
node {
  name: "rnn/rnn2/forget_bias/Read/Identity"
  op: "Identity"
  input: "rnn/rnn2/forget_bias/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/stacked_rnn_cells/InputHint-UnidirectionalSequenceLstm-47eb6ae3de2411e9a4834201c0a80701-13-None-forget_bias"
  op: "Identity"
  input: "rnn/rnn2/forget_bias/Read/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_tflite_function_input_index"
    value {
      i: 13
    }
  }
  attr {
    key: "_tflite_function_name"
    value {
      s: "UnidirectionalSequenceLstm"
    }
  }
  attr {
